DarrenAlman/lpc2478-icdev/lpccodebuddle-makefile/EMAC/emac.c
  for ( i = 0; i < 0x100; i++ );	/* short delay */

  WritePHY( PHY_BMCR, BMCR_RESET );
  for ( i = 0; i < 0x20; i++ );	/* short delay */

  timeout = MII_BMSR_TIMEOUT * 4;
  while ( timeout != 0 )
  {
	regValue = ReadPHY( PHY_BMCR );
	if ( (regValue & BMCR_RESET) == 0x0000 )	
	{
	  break;		/* Reset self cleaned once the reset process is complete */	
	}
	timeout--;	
  }
  if ( timeout == 0 )
  {
	return ( FALSE );
  }

  if ( PHYType == NATIONAL_PHY )
  {
	/* check PHY IDs to make sure the reset takes place and PHY
	is in its default state. See National PHY DP83848 Users Manual 
	for more details */
	regValue = ReadPHY( PHY_PHYIDR1 );
	if ( (regValue & 0x2000) != 0x2000 )
	{
	  return ( FALSE );
	}

	regValue = ReadPHY( PHY_PHYIDR2 );
	if ( (regValue & 0x5C90) != 0x5C90 )
	{
	  return ( FALSE );
	}
  }
  else if ( PHYType == MICREL_PHY )
  {
	regValue = ReadPHY( PHY_PHYIDR1 );
	if ( (regValue & 0x00FF) != 0x0022 )
	{
	  return ( FALSE );
	}

	regValue = ReadPHY( PHY_PHYIDR2 );
	if ( (regValue & 0x1610) != 0x1610 )
	{
	  return ( FALSE );
	}
  }

  WritePHY( PHY_BMCR, BMCR_AN | BMCR_RE_AN ); /* auto negotiation, restart AN */
  /* RE_AN should be self cleared */
//	while ( ((regValue = ReadPHY( PHY_BMCR )) & BMCR_RE_AN) );

  if ( PHYType == NATIONAL_PHY )
  { 
	timeout = MII_BMSR_TIMEOUT;
	while ( timeout != 0 )
	{
	  regValue = ReadPHY( NSM_PHY_PHYSTS );
	  if ( (regValue & 0x0011) == 0x0011 )	
	  {
		break;		/* link established if bit 0 is set */
	  }
	  timeout--;
	}

	if ( timeout == 0 )
	{
	  return ( FALSE );
	}

	/* Link established from here on */
	if ( regValue & 0x04 )
	  Duplex = FULL_DUPLEX;
	else
	  Duplex = HALF_DUPLEX;

	if ( regValue & 0x02 )
	  Speed = SPEED_10;
	else
	  Speed = SPEED_100;
  }

  else if ( PHYType == MICREL_PHY )
  { 
	timeout = MII_BMSR_TIMEOUT;
	while ( timeout != 0 )
	{
	  regValue = ReadPHY( PHY_BMSR );
	  if ( (regValue & (BMSR_AUTO_DONE|BMSR_LINK_ESTABLISHED)) 
			== (BMSR_AUTO_DONE|BMSR_LINK_ESTABLISHED) )	
	  {
		break;		/* auto nego complete and link established if bit 2 
					and 5 are set */
	  }
	  timeout--;
	}
    if ( timeout == 0 )
	{
	  return ( FALSE );
	}

	regValue = ReadPHY( MIC_PHY_100BASE_PHY_CTRL );
	/* successful negotiations; update link info */
	regValue &= 0x001C;
	switch ( regValue )
	{
	  case 0x0004:
		Speed = SPEED_10;
		Duplex = HALF_DUPLEX;
	  break;
	  case 0x0008:
		Speed = SPEED_100;
		Duplex = HALF_DUPLEX;
	  break;
	  case 0x0014:
		Speed = SPEED_10;
		Duplex = FULL_DUPLEX;
	  break;
	  case 0x0018:
		Speed = SPEED_100;
		Duplex = FULL_DUPLEX;
	  break;
	  default:	// Should not come here, force to set default, 100 FULL_DUPLEX
		Speed = SPEED_100;
		Duplex = FULL_DUPLEX;
		break;
	}
  }
  return ( TRUE );
}

/*****************************************************************************
** Function name:		EMACTxDesciptorInit
**
** Descriptions:		initialize EMAC TX descriptor table
**
** parameters:			None
** Returned value:		None
** 
*****************************************************************************/
void EMACTxDescriptorInit( void )
{
  DWORD i;
  DWORD *tx_desc_addr, *tx_status_addr;
   
  /*-----------------------------------------------------------------------------      
   * setup the Tx status,descriptor registers -- 
   * Note, the actual tx packet data is loaded into the ahb2_sram16k memory as part
   * of the simulation
   *----------------------------------------------------------------------------*/ 
  MAC_TXDESCRIPTOR = TX_DESCRIPTOR_ADDR;	/* Base addr of tx descriptor array */
  MAC_TXSTATUS = TX_STATUS_ADDR;		/* Base addr of tx status */
  MAC_TXDESCRIPTORNUM = EMAC_TX_DESCRIPTOR_COUNT - 1;	/* number of tx descriptors, 16 */

  for ( i = 0; i < EMAC_TX_DESCRIPTOR_COUNT; i++ )
  {
	tx_desc_addr = (DWORD *)(TX_DESCRIPTOR_ADDR + i * 8);	/* two words at a time, packet and control */
	*tx_desc_addr = (DWORD)(EMAC_TX_BUFFER_ADDR + i * EMAC_BLOCK_SIZE);
	*(tx_desc_addr+1) = (DWORD)(EMAC_TX_DESC_INT | (EMAC_BLOCK_SIZE - 1));	/* set size only */
  }
    
  for ( i = 0; i < EMAC_TX_DESCRIPTOR_COUNT; i++ )
  {
	tx_status_addr = (DWORD *)(TX_STATUS_ADDR + i * 4);	/* TX status, one word only, status info. */
	*tx_status_addr = (DWORD)0;		/* initially, set status info to 0 */
  }
  MAC_TXPRODUCEINDEX = 0x0;	/* TX descriptors point to zero */
  return;
}

/*****************************************************************************
** Function name:		EMACRxDesciptorInit
**
** Descriptions:		initialize EMAC RX descriptor table
**
** parameters:			None
** Returned value:		None
** 
*****************************************************************************/
void EMACRxDescriptorInit( void )
{
  DWORD i;
  DWORD *rx_desc_addr, *rx_status_addr;
   
  /*-----------------------------------------------------------------------------      
   * setup the Rx status,descriptor registers -- 
   * Note, the actual rx packet data is loaded into the ahb2_sram16k memory as part
   * of the simulation
   *----------------------------------------------------------------------------*/ 
  MAC_RXDESCRIPTOR = RX_DESCRIPTOR_ADDR;	/* Base addr of rx descriptor array */
  MAC_RXSTATUS = RX_STATUS_ADDR;			/* Base addr of rx status */
  MAC_RXDESCRIPTORNUM = EMAC_RX_DESCRIPTOR_COUNT - 1;	/* number of rx descriptors, 16 */

  for ( i = 0; i < EMAC_RX_DESCRIPTOR_COUNT; i++ )
  {
	/* two words at a time, packet and control */
	rx_desc_addr = (DWORD *)(RX_DESCRIPTOR_ADDR + i * 8);
	*rx_desc_addr = (DWORD)(EMAC_RX_BUFFER_ADDR + i * EMAC_BLOCK_SIZE);
	*(rx_desc_addr+1) = (DWORD)(EMAC_RX_DESC_INT | (EMAC_BLOCK_SIZE - 1));	/* set size only */    
  }
 
  for ( i = 0; i < EMAC_RX_DESCRIPTOR_COUNT; i++ )
  {
	/* RX status, two words, status info. and status hash CRC. */
	rx_status_addr = (DWORD *)(RX_STATUS_ADDR + i * 8);	
	*rx_status_addr = (DWORD)0;	/* initially, set both status info and hash CRC to 0 */
	*(rx_status_addr+1) = (DWORD)0; 
  }
  MAC_RXCONSUMEINDEX = 0x0;	/* RX descriptor points to zero */
  return;
}

/*****************************************************************************
** Function name:		EMACInit
**
** Descriptions:		initialize EMAC port
**
** parameters:			None
** Returned value:		None
** 
*****************************************************************************/
DWORD EMACInit( void )
{
  DWORD regVal;
  DWORD i;

  /* turn on the ethernet MAC clock in PCONP, bit 30 */
  regVal = PCONP;
  regVal |= PCONP_EMAC_CLOCK;
  PCONP = regVal;

