DarrenAlman/lpc2478-icdev/lpccodebuddle-makefile/EMAC/emac.c
  for ( i = 0; i < 0x100; i++ );	/* short delay */
  /*------------------------------------------------------------------------------      
   * write to PINSEL2/3 to select the PHY functions on P1[17:0]
   *-----------------------------------------------------------------------------*/
  /* documentation needs to be updated */
#if RMII
  /* P1.6, ENET-TX_CLK, has to be set for EMAC to address a BUG in the engineering 
   version, even if this pin is not used for RMII interface. This bug has been fixed,
   and this port pin can be used as GPIO pin in the future release. */ 
  /* Unfortunately, this MCB2300 board still has the old eng. version LPC23xx chip
   on it. On the new rev.(xxAY, released on 06/22/2007), P1.6 should NOT be set.
  See errata for more details. */
  regVal = MAC_MODULEID;
  if ( regVal == PHILIPS_EMAC_MODULE_ID ) 
  {
	/* This is the rev."-" ID for the existing MCB2300 board,
	on rev. A, regVal should NOT equal to PHILIPS_EMAC_MODULE_ID,
	P1.6 should NOT be set. */
	PINSEL2 = 0x50151105;	/* selects P1[0,1,4,6,8,9,10,14,15] */
  }
  else
  {
	PINSEL2 = 0x50150105;	/* selects P1[0,1,4,8,9,10,14,15] */
  }
  PINSEL3 = 0x00000005;	/* selects P1[17:16] */
#else					/* else RMII, then it's MII mode */      
  PINSEL2 = 0x55555555;	/* selects P1[15:0] */
  PINSEL3 = 0x00000005;	/* selects P1[17:16] */
#endif

  /*-----------------------------------------------------------------------------      
   * write the MAC config registers
   *----------------------------------------------------------------------------*/
  MAC_MAC1 = 0xCF00;	/* [15],[14],[11:8] -> soft resets all MAC internal modules */
  MAC_COMMAND = 0x0038;	/* reset all datapaths and host registers */

  for ( i = 0; i < 0x04; i++ );	/* short delay after reset */
  MAC_MAC1 = 0x0;		/* deassert all of the above soft resets in MAC1 */

  EMAC_TxDisable();
  EMAC_RxDisable();
    
  MAC_MAC2 = 0x00;		/* initialize MAC2 register to default value */

  /* Non back to back inter-packet gap */
  MAC_IPGR = 0x0012;	/* use the default value recommended in the users manual */

  MAC_CLRT = 0x370F;	/* Use the default value in the users manual */
  MAC_MAXF = 0x0600;	/* Use the default value in the users manual */
    
  /* On Keil and Internal Engineering board, National PHY is used.
     On IAR and Embedded Artists board, Micrel PHY is used. However,
	 on IAR board and Embedded Artists board, due to the different
	 I/O pin setting, the PHY addresses are different. On IAR board,
	 Internal Engineering board, and Keil board, the PHY address is
	 0x0001, on Embedded Artists board, the PHY address is 0x0000. 
	 See definition in mac.h */
#if (KEIL_BOARD_LPC23XX || ENG_BOARD_LPC24XX)
  if ( PHYInit( NATIONAL_PHY ) == FALSE )
  {
	return ( FALSE );
  }
#else
#if (IAR_BOARD_LPC23XX || EA_BOARD_LPC24XX)
  if ( PHYInit( MICREL_PHY ) == FALSE )
  {
	return ( FALSE );
  }
#endif
#endif

  /* write the station address registers */
  MAC_SA0 = EMAC_ADDR12; 
  MAC_SA1 = EMAC_ADDR34; 
  MAC_SA2 = EMAC_ADDR56;
   
  if ( (Speed == SPEED_10) && (Duplex == HALF_DUPLEX) )
  {
	MAC_MAC2 = 0x30;		/* half duplex, CRC and PAD enabled. */
	MAC_SUPP &= ~0x0100;	/* RMII Support Reg. speed is set to 10M */
#if RMII
	MAC_COMMAND |= 0x0240;
#else
	MAC_COMMAND |= 0x0040;	/* [10]-half duplex,[9]-MII mode,[6]-Pass runt 
							frame, [5]-RxReset */
#endif
	/* back to back int-packet gap */
	MAC_IPGT = 0x0012;		/* IPG setting in half duplex mode */ 
  }
  else if ( (Speed == SPEED_100) && (Duplex == HALF_DUPLEX) )
  {
	MAC_MAC2 = 0x30;		/* half duplex, CRC and PAD enabled. */
	MAC_SUPP |= 0x0100;		/* RMII Support Reg. speed is set to 100M */
#if RMII
	MAC_COMMAND |= 0x0240;
#else
	MAC_COMMAND |= 0x0040;	/* [10]-half duplex,[9]-MII mode,[6]-Pass runt frame,
							[5]-RxReset */
#endif
	/* back to back int-packet gap */
	MAC_IPGT = 0x0012;		/* IPG setting in half duplex mode */
  }
  else if ( (Speed == SPEED_10) && (Duplex == FULL_DUPLEX) )
  {
	MAC_MAC2 = 0x31;		/* full duplex, CRC and PAD enabled. */
	MAC_SUPP &= ~0x0100;	/* RMII Support Reg. speed is set to 10M */
#if RMII
	MAC_COMMAND |= 0x0640;
#else
	MAC_COMMAND |= 0x0440;	/* [10]-full duplex,[9]-MII mode,[6]-Pass runt frame,
							[5]-RxReset */
#endif
	/* back to back int-packet gap */
	MAC_IPGT = 0x0015;		/* IPG setting in full duplex mode */
  }
  else if ( (Speed == SPEED_100) && (Duplex == FULL_DUPLEX) )			
							/* default setting, 100 BASE, FULL DUPLEX */
  {
	MAC_MAC2 = 0x31;		/* full duplex, CRC and PAD enabled. */
	MAC_SUPP |= 0x0100;		/* RMII Support Reg. speed is set to 100M */
#if RMII
	MAC_COMMAND |= 0x0640;
#else
	MAC_COMMAND |= 0x0440;	/* [10]-full duplex,[9]-MII mode,[6]-Pass runt frame,
							[5]-RxReset */
#endif
	/* back to back int-packet gap */
	MAC_IPGT = 0x0015;	/* IPG setting in full duplex mode */
  }

  EMACTxDescriptorInit();
  EMACRxDescriptorInit();

  MAC_MAC1 |= 0x0002;		/* [1]-Pass All Rx Frame */

  /* Set up RX filter, accept broadcast and perfect station */
#if ACCEPT_BROADCAST
  MAC_RXFILTERCTRL = 0x0022;	/* [1]-accept broadcast, [5]accept perfect */
#else
  MAC_RXFILTERCTRL = 0x0020;	/* accept perfect match only */  
#endif

#if MULTICAST_UNICAST
  MAC_RXFILTERCTRL |= 0x0005;
#endif

#if ENABLE_HASH
  MAC_RXFILTERCTRL |= 0x0018;
#endif

  MAC_INTCLEAR = 0xFFFF;	/* clear all MAC interrupts */    
  /* MAC interrupt related register setting */
  if ( install_irq( EMAC_INT, (void *)EMACHandler, HIGHEST_PRIORITY ) == FALSE )
  {
	return (FALSE);
  }

#if ENABLE_WOL
  MAC_RXFILTERWOLCLR = 0xFFFF;/* set all bits to clear receive filter WOLs */
  MAC_RXFILTERCTRL |= 0x2000;	/* enable Rx Magic Packet and RxFilter Enable WOL */
  MAC_INTENABLE = 0x2000;	/* only enable WOL interrupt */
#else
  MAC_INTENABLE = 0x00FF;	/* Enable all interrupts except SOFTINT and WOL */
#endif
  return ( TRUE );
}

/*****************************************************************************
** Function name:		EMACReceiveFractions
**
** Descriptions:		Dealing with a fraction of EMAC packet
**
** parameters:			StartIndex and End Index
** Returned value:		packet length
** 
*****************************************************************************/
DWORD EMACReceiveFractions( DWORD StartIndex, DWORD EndIndex )
{
  DWORD i, RxLength = 0;
  DWORD RxSize;
  DWORD *rx_status_addr;

  for ( i = StartIndex; i < EndIndex; i++ )
  {
	/* Get RX status, two words, status info. and status hash CRC. */
	rx_status_addr = (DWORD *)(RX_STATUS_ADDR + StartIndex * 8);
	RxSize = (*rx_status_addr & DESC_SIZE_MASK) - 1;
	/* two words at a time, packet and control */
	CurrentRxPtr += EMAC_BLOCK_SIZE;
	StartIndex++;
	/* last fragment of a frame */
	if ( *rx_status_addr & RX_DESC_STATUS_LAST ) 
	{
	  /* set INT bit and RX packet size */
	  MAC_RXCONSUMEINDEX = StartIndex;
	  RxLength += RxSize;
	  break; 
	}
	else	/* In the middle of the frame, the RxSize should be EMAC_BLOCK_SIZE */
			/* In the emac.h, the EMAC_BLOCK_SIZE has been set to the largest 
			ethernet packet length to simplify the process, so, it should not 
			come here in any case to deal with fragmentation. Otherwise, 
			fragmentation and repacking will be needed. */
	{
	  /* set INT bit and maximum block size */
	  MAC_RXCONSUMEINDEX = StartIndex;
	  /* wait until the whole block is received, size is EMAC_BLOCK_SIZE. */
	  while ( (*rx_status_addr & DESC_SIZE_MASK) != (EMAC_BLOCK_SIZE - 1));
	  RxLength += RxSize;
	}
  }
  return( RxLength );
}

/*****************************************************************************
** Function name:		EMACReceive
**
** Descriptions:		Receive a EMAC packet, called by ISR
**
** parameters:			buffer pointer
** Returned value:		packet length
** 
*****************************************************************************/
DWORD EMACReceive( DWORD *EMACBuf )
{
  DWORD RxProduceIndex, RxConsumeIndex;
  DWORD RxLength = 0;
  DWORD Counter = 0;

  /* the input parameter, EMCBuf, needs to be word aligned */
  RxProduceIndex = MAC_RXPRODUCEINDEX;
  RxConsumeIndex = MAC_RXCONSUMEINDEX;

