DarrenAlman/lpc2478-icdev/lpccodebuddle-makefile/EMAC/emac.c
  if ( RxProduceIndex == EMAC_RX_DESCRIPTOR_COUNT )
  {
	/* reach the limit, that probably should never happen */
	MAC_RXPRODUCEINDEX = 0;
	CurrentRxPtr = EMAC_RX_BUFFER_ADDR;
  }

  /* a packet has arrived. */
  if ( RxProduceIndex != RxConsumeIndex )
  {
	if ( RxProduceIndex < RxConsumeIndex )	/* Wrapped around already */
	{
	  /* take care of unwrapped, RxConsumeIndex to EMAC_RX_DESCERIPTOR_COUNT */
	  RxLength += EMACReceiveFractions( RxConsumeIndex, EMAC_RX_DESCRIPTOR_COUNT );
	  Counter++;
	  PacketReceived = TRUE;	    
	
	  /* then take care of wrapped, 0 to RxProduceIndex */
	  if ( RxProduceIndex > 0 )
	  {
		RxLength += EMACReceiveFractions( 0, RxProduceIndex );
		Counter++;
	  }
	}
	else					/* Normal process */
	{
	    RxLength += EMACReceiveFractions( RxConsumeIndex, RxProduceIndex );
		Counter++;	
	}
  }
  return( RxLength );
}

/*****************************************************************************
** Function name:		EMACSend
**
** Descriptions:		Send a EMAC packet
**
** parameters:			buffer pointer, buffer length
** Returned value:		true or false
** 
*****************************************************************************/
DWORD EMACSend( DWORD *EMACBuf, DWORD length )
{
  DWORD *tx_desc_addr;
  DWORD TxProduceIndex;
  DWORD TxConsumeIndex;
  DWORD i, templen;

  TxProduceIndex = MAC_TXPRODUCEINDEX;
  TxConsumeIndex = MAC_TXCONSUMEINDEX;

  if ( TxConsumeIndex != TxProduceIndex )
  {
	return ( FALSE );
  }

  if ( TxProduceIndex == EMAC_TX_DESCRIPTOR_COUNT )
  {
	/* reach the limit, that probably should never happen */
	/* To be tested */
	MAC_TXPRODUCEINDEX = 0;
  }

  if ( length > EMAC_BLOCK_SIZE )
  {
	templen = length;
	for ( i = 0; (DWORD)(length/EMAC_BLOCK_SIZE) + 1; i++ )
	{
	  templen = length - EMAC_BLOCK_SIZE;
	  /* two words at a time, packet and control */
	  tx_desc_addr = (DWORD *)(TX_DESCRIPTOR_ADDR + TxProduceIndex * 8);
	  /* descriptor status needs to be checked first */
	  if ( templen % EMAC_BLOCK_SIZE )
	  {
		/* full block */ 
		*tx_desc_addr = (DWORD)(EMACBuf + i * EMAC_BLOCK_SIZE);
		/* set TX descriptor control field */
		*(tx_desc_addr+1) = (DWORD)(EMAC_TX_DESC_INT | (EMAC_BLOCK_SIZE - 1));
		TxProduceIndex++;
		if ( TxProduceIndex == EMAC_TX_DESCRIPTOR_COUNT )
    	{
		  TxProduceIndex = 0;
		}
		MAC_TXPRODUCEINDEX = TxProduceIndex;	/* transmit now */
	  }
	  else
	  {
		/* last fragment */
		*tx_desc_addr = (DWORD)(EMACBuf + i * EMAC_BLOCK_SIZE);
		/* set TX descriptor control field */
		*(tx_desc_addr+1) = (DWORD)(EMAC_TX_DESC_INT | EMAC_TX_DESC_LAST | (templen -1) );
		TxProduceIndex++;		/* transmit now */
		if ( TxProduceIndex == EMAC_TX_DESCRIPTOR_COUNT )
    	{
		  TxProduceIndex = 0;
		}
		MAC_TXPRODUCEINDEX = TxProduceIndex;	/* transmit now */
		break;
	  }    
	}
  }
  else
  {
	tx_desc_addr = (DWORD *)(TX_DESCRIPTOR_ADDR + TxProduceIndex * 8);
	/* descriptor status needs to be checked first */
	*tx_desc_addr = (DWORD)(EMACBuf);
	/* set TX descriptor control field */
	*(tx_desc_addr+1) = (DWORD)(EMAC_TX_DESC_INT | EMAC_TX_DESC_LAST | (length -1));
	TxProduceIndex++;		/* transmit now */
	if ( TxProduceIndex == EMAC_TX_DESCRIPTOR_COUNT )
	{
	  TxProduceIndex = 0;
	}
	MAC_TXPRODUCEINDEX = TxProduceIndex;
  }
  return ( TRUE );
}

/*********************************************************************************
**                            End Of File
*********************************************************************************/
